espressif/esp-idf/components/esp32/include/soc/rtc_io_reg.h
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_RTC_IO_REG_H_
#define _SOC_RTC_IO_REG_H_

#include "soc.h"

#define RTC_GPIO_OUT (DR_REG_RTCIO_BASE + 0x0)
#define RTC_IO_RTC_GPIO_OUT_DATA 0x0003FFFF
#define RTC_IO_RTC_GPIO_OUT_DATA_S 14

#define RTC_GPIO_OUT_W1TS (DR_REG_RTCIO_BASE + 0x4)
#define RTC_IO_RTC_GPIO_OUT_DATA_W1TS 0x0003FFFF
#define RTC_IO_RTC_GPIO_OUT_DATA_W1TS_S 14

#define RTC_GPIO_OUT_W1TC (DR_REG_RTCIO_BASE + 0x8)
#define RTC_IO_RTC_GPIO_OUT_DATA_W1TC 0x0003FFFF
#define RTC_IO_RTC_GPIO_OUT_DATA_W1TC_S 14

#define RTC_GPIO_ENABLE (DR_REG_RTCIO_BASE + 0xc)
#define RTC_IO_RTC_GPIO_ENABLE 0x0003FFFF
#define RTC_IO_RTC_GPIO_ENABLE_S 14

#define RTC_GPIO_ENABLE_W1TS (DR_REG_RTCIO_BASE + 0x10)
#define RTC_IO_RTC_GPIO_ENABLE_W1TS 0x0003FFFF
#define RTC_IO_RTC_GPIO_ENABLE_W1TS_S 14

#define RTC_GPIO_ENABLE_W1TC (DR_REG_RTCIO_BASE + 0x14)
#define RTC_IO_RTC_GPIO_ENABLE_W1TC 0x0003FFFF
#define RTC_IO_RTC_GPIO_ENABLE_W1TC_S 14

#define RTC_GPIO_STATUS (DR_REG_RTCIO_BASE + 0x18)
#define RTC_IO_RTC_GPIO_STATUS_INT 0x0003FFFF
#define RTC_IO_RTC_GPIO_STATUS_INT_S 14

#define RTC_GPIO_STATUS_W1TS (DR_REG_RTCIO_BASE + 0x1c)
#define RTC_IO_RTC_GPIO_STATUS_INT_W1TS 0x0003FFFF
#define RTC_IO_RTC_GPIO_STATUS_INT_W1TS_S 14

#define RTC_GPIO_STATUS_W1TC (DR_REG_RTCIO_BASE + 0x20)
#define RTC_IO_RTC_GPIO_STATUS_INT_W1TC 0x0003FFFF
#define RTC_IO_RTC_GPIO_STATUS_INT_W1TC_S 14

#define RTC_GPIO_IN (DR_REG_RTCIO_BASE + 0x24)
#define RTC_IO_RTC_GPIO_IN_NEXT 0x0003FFFF
#define RTC_IO_RTC_GPIO_IN_NEXT_S 14

#define RTC_GPIO_PIN0 (DR_REG_RTCIO_BASE + 0x28)
#define RTC_IO_RTC_GPIO_PIN0_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN0_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN0_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN0_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN0_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN0_PAD_DRIVER_S 2

#define RTC_GPIO_PIN1 (DR_REG_RTCIO_BASE + 0x2c)
#define RTC_IO_RTC_GPIO_PIN1_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN1_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN1_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN1_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN1_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN1_PAD_DRIVER_S 2

#define RTC_GPIO_PIN2 (DR_REG_RTCIO_BASE + 0x30)
#define RTC_IO_RTC_GPIO_PIN2_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN2_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN2_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN2_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN2_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN2_PAD_DRIVER_S 2

#define RTC_GPIO_PIN3 (DR_REG_RTCIO_BASE + 0x34)
#define RTC_IO_RTC_GPIO_PIN3_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN3_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN3_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN3_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN3_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN3_PAD_DRIVER_S 2

#define RTC_GPIO_PIN4 (DR_REG_RTCIO_BASE + 0x38)
#define RTC_IO_RTC_GPIO_PIN4_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN4_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN4_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN4_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN4_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN4_PAD_DRIVER_S 2

#define RTC_GPIO_PIN5 (DR_REG_RTCIO_BASE + 0x3c)
#define RTC_IO_RTC_GPIO_PIN5_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN5_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN5_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN5_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN5_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN5_PAD_DRIVER_S 2

#define RTC_GPIO_PIN6 (DR_REG_RTCIO_BASE + 0x40)
#define RTC_IO_RTC_GPIO_PIN6_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN6_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN6_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN6_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN6_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN6_PAD_DRIVER_S 2

#define RTC_GPIO_PIN7 (DR_REG_RTCIO_BASE + 0x44)
#define RTC_IO_RTC_GPIO_PIN7_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN7_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN7_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN7_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN7_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN7_PAD_DRIVER_S 2

#define RTC_GPIO_PIN8 (DR_REG_RTCIO_BASE + 0x48)
#define RTC_IO_RTC_GPIO_PIN8_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN8_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN8_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN8_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN8_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN8_PAD_DRIVER_S 2

#define RTC_GPIO_PIN9 (DR_REG_RTCIO_BASE + 0x4c)
#define RTC_IO_RTC_GPIO_PIN9_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN9_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN9_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN9_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN9_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN9_PAD_DRIVER_S 2

#define RTC_GPIO_PIN10 (DR_REG_RTCIO_BASE + 0x50)
#define RTC_IO_RTC_GPIO_PIN10_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN10_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN10_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN10_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN10_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN10_PAD_DRIVER_S 2

#define RTC_GPIO_PIN11 (DR_REG_RTCIO_BASE + 0x54)
#define RTC_IO_RTC_GPIO_PIN11_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN11_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN11_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN11_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN11_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN11_PAD_DRIVER_S 2

#define RTC_GPIO_PIN12 (DR_REG_RTCIO_BASE + 0x58)
#define RTC_IO_RTC_GPIO_PIN12_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN12_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN12_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN12_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN12_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN12_PAD_DRIVER_S 2

#define RTC_GPIO_PIN13 (DR_REG_RTCIO_BASE + 0x5c)
#define RTC_IO_RTC_GPIO_PIN13_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN13_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN13_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN13_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN13_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN13_PAD_DRIVER_S 2

#define RTC_GPIO_PIN14 (DR_REG_RTCIO_BASE + 0x60)
#define RTC_IO_RTC_GPIO_PIN14_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN14_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN14_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN14_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN14_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN14_PAD_DRIVER_S 2

#define RTC_GPIO_PIN15 (DR_REG_RTCIO_BASE + 0x64)
#define RTC_IO_RTC_GPIO_PIN15_WAKEUP_ENABLE (BIT(10))
#define RTC_IO_RTC_GPIO_PIN15_WAKEUP_ENABLE_S 10
#define RTC_IO_RTC_GPIO_PIN15_INT_TYPE 0x00000007
#define RTC_IO_RTC_GPIO_PIN15_INT_TYPE_S 7
#define RTC_IO_RTC_GPIO_PIN15_PAD_DRIVER (BIT(2))
#define RTC_IO_RTC_GPIO_PIN15_PAD_DRIVER_S 2

